<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Francine Luce - Jazz Singer. Recording Reviews</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="franStyle.css" rel="stylesheet" type="text/css">
</head>

<body bgcolor="#000000" text="#FFFF99" link="#FFFF00" vlink="#996600" alink="#FFFFFF" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<table width="740" border="0" cellpadding="0" cellspacing="0">
  <tr valign="top"> 
    <td width="1%" height="1444"><img src="../singer_images/topmenu/spacer.gif" width="10" height="10"></td>
    <td>
<table width="740" border="0" cellpadding="0" cellspacing="0">
        <tr> 
          <td colspan="3"> <p><img src="../singer_images/titles/recrev.png" width="205" height="40"></p></td>
          <td width="42" rowspan="31">&nbsp;</td>
        </tr>
        <tr> 
          <td height="5" colspan="3" align="left" valign="top" bgcolor="#FF3300"></td>
        </tr>
        <tr> 
          <td height="5" colspan="3" align="left" valign="top"></td>
        </tr>
        <tr> 
          <td width="315" valign="top"> <p>&nbsp;</p></td>
          <td width="15">&nbsp;</td>
          <td width="540" align="right" valign="top">&nbsp;</td>
        </tr>
        <tr> 
          <td height="40" colspan="3"> <p><strong>B&ograve; kay la vi - a<br>
              OGUN, c/o Cadillac Jazz Distribution</strong></p></td>
        </tr>
        <tr> 
          <td><p align="left"><br>
            </p></td>
          <td rowspan="2">&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td height="20" align="center" valign="top"> <p align="center"><img src="../singer_images/ogunc012.jpg" width="210" height="208"></p></td>
          <td><p>Francine Luce is a vocalist from Martinique, who is joined by 
              the stellar line up of Claude Deppa, Evan Parker, Paul Rutherford, 
              Keith Tippett, Paul Rogers and Louis Moholo. Her heartfelt singing 
              (in both French and English) dominates the album, and she is as 
              inventive in her use of wordless vocal effects as any of the players 
              on their instruments. As she notes: &#8220;The frogs, crickets and 
              birds from Martinique are good improvisers, too.&#8221; Her vocalising 
              suggests she has listened hard to them. Intriguingly, Luce, Parker 
              and Rogers play as a trio on the track &#8216;Pok&eacute;ya&#8217;, 
              on which all three are credited with playing &#8220; water&#8221;, 
              and Luce does sound rather bubbly. I can&#8217;t wait for the live 
              show! <br>
              <strong>RUBBERNECK; England</strong> - John Eyles </p>
            <p>&nbsp;</p></td>
        </tr>
        <tr> 
          <td colspan="3">&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><p align="left">&#8230;Une voix merveilleuse &#8230;Francine 
              Luce s&#8217;est entour&eacute;e d&#8217;une &eacute;quipe de r&ecirc;ve 
              pour son premier disque. Des chansons et des textes en Cr&eacute;ole, 
              en Fran&ccedil;ais et en Anglais font bon m&eacute;nage avec des 
              improvisations vocales et la recherche sonore. De belles m&eacute;lodies 
              cr&eacute;oles flottent dans le brouillard des sons produits dans 
              l&#8217;eau par Luce, Parker et Deppa (Pok&eacute;ya)!.. Quelle 
              voix!!<br>
            </p></td>
        </tr>
        <tr> 
          <td height="18"> <p align="right">&nbsp;</p></td>
          <td>&nbsp;</td>
          <td valign="bottom">&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><p><em>&#8230;A marvellous voice...Francine has surrounded 
              herself with a dream team for her first record. The songs and texts 
              in Creole, French and English mix well with the vocal improvisation 
              and exploration of sound. The beautiful Creole melodies blend with 
              the sound of water that Luce, Parker and Deppa use on (Pok&eacute;ya)&#8230; 
              What a voice!!</em></p></td>
        </tr>
        <tr> 
          <td height="18">&nbsp;</td>
          <td>&nbsp;</td>
          <td><p align="right"><strong>CHRONIQUES</strong> - Jean-Michel Van Schouwburg</p></td>
        </tr>
        <tr> 
          <td colspan="3"><p align="right">&nbsp;</p></td>
        </tr>
        <tr> 
          <td height="20"> <p align="right">&nbsp;</p></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><p>&#8230; L&#8217;&eacute;motion est partout, dans 
              la moindre note du pianiste, dans le plus petit souffle de la voix 
              &#8230;L&#8217;&eacute;motion, la rigueur et la qualit&eacute; sont 
              au rendez-vous&#8230; Ce disque est une (autre) grande merveille. 
            </p></td>
        </tr>
        <tr> 
          <td><p>&nbsp;</p></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><div align="right"> 
              <p align="left"><em>&#8230;Emotion is everywhere, in the smallest 
                piano sounds and vocal breath&#8230;Emotion, precision, and high 
                quality are united&#8230; This CD is marvellous.</em></p>
            </div></td>
        </tr>
        <tr> 
          <td height="16" colspan="3"> <div align="right"> 
              <p><strong>IMPROJAZZ N 60; France</strong></p>
            </div></td>
        </tr>
        <tr> 
          <td><p>&nbsp;</p></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><div align="right"> 
              <p align="left">&#8230; With an astonishing voice. On B&ograve; 
                kay la vi-a she sings with complete conviction and technical surety, 
                in a very personal hybrid of traditional song styles and free 
                improvisation. One glance at her band should be a sufficient indication 
                not just of her musical proclivities but of her great talent. 
                Parker, Rutherford, Rogers, Tippetts and Moholo are masters of 
                extended technique and high level of communication - Luce has 
                no problem jumping in at the most intense level of musicality 
                and interaction&#8230; I hope to be hearing more Luce in the future. 
                Her range, tone, and articulation are fabulous&#8230;Strongly 
                recommended.</p>
            </div></td>
        </tr>
        <tr> 
          <td colspan="3"><p align="right">The review of Jazz &amp; Blues: Creative 
              Improvised Music</p></td>
        </tr>
        <tr> 
          <td colspan="3" valign="top">
<div align="right">
              <p align="right"><strong>Cadence; USA</strong> - Jason Bivins</p>
            </div>
            </td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td><div align="right"> 
              <p>&nbsp;</p>
            </div></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><p>... Sie ist die Entdeckung des Jahres - ohne &Uuml;bertreibung. 
              Luce besitzt jene Art von Stimme, die einem, wie&#8217;s so sch&ouml;n 
              hei&szlig;t, die G&auml;nsehaut aufsteigen l&auml;sst. Eine begnadete 
              Improvisatorin, die es versteht, ohne M&uuml;hen zwischen liedhaftem 
              Vortrag und freien Klangfarbeninteraktionen einen vibrierenden Bogen 
              zu spannen. Da sie gro&szlig;teils in England lebt, war es keine 
              Frage, dass Luce umgehendst mit der Creme der britischen Improvisationsmusiker 
              in Kontakt kam. Die improvisierten St&uuml;cke haben eine &uuml;berwiegend 
              lyrische, gl&auml;serne Stimmung. Luce legt entweder wie T&uuml;ll 
              ihre Stimme &uuml;ber die feingesponnenen Klangschichten ihrer Partner 
              oder reibt sich mit hei&szlig;em Atem an ihnen. Nicht oft ist ein 
              Debut von solch &uuml;berzeugender Kraft und emotionaler Tiefe.</p></td>
        </tr>
        <tr> 
          <td><p>&nbsp;</p></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td colspan="3"><p><em>&#8230; She is the discovery of the year- and 
              that&#8217;s no exaggeration. Luce owns the type of voice which 
              &#8216;gives you goosepimpels&#8217;, so to speak. She is a gifted 
              improvisor who knows how to spin a vibrating web of songful discourse 
              and free sound/colourinteractions. <br>
              She resides mostly in England and is in contact with the &#8216;cr&egrave;me 
              de la cr&egrave;me&#8217; of British music improvisors. <br>
              The improvised pieces on the CD have a predominantly, glasslike 
              mood. Luce&#8217;s voice either covers the finely spun soundlayers 
              of her musical partners like a piece of lace or grates against them 
              with hot breath. <br>
              One doesn&#8217;t often see a debut of such conviction, strengh 
              and emotional debth.</em></p></td>
        </tr>
        <tr> 
          <td height="18"> <p>&nbsp;</p></td>
          <td>&nbsp;</td>
          <td><p align="right"><strong>JAZZ LIVE; Austria</strong> - Han</p></td>
        </tr>
        <tr> 
          <td><div align="right"> 
              <p>&nbsp;</p>
            </div></td>
          <td>&nbsp;</td>
          <td> <p align="right">&nbsp;</p></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td><div align="center"> 
              <p>&nbsp;</p>
              <p>&nbsp;</p>
            </div></td>
          <td>&nbsp;</td>
          <td>&nbsp;</td>
        </tr>
      </table></td></tr></table>
</body>
</html>
